#+title: Program Organization
#+STARTUP:overview hideblocks indent
#+OPTIONS: toc:nil num:nil ^:nil
#+PROPERTY: header-args:C :main yes :includes <stdio.h> <stdlib.h> <string.h> <time.h> :results output :exports both :comments none :noweb yes
* PROJECT Example: Static Local Variables

- *Task:* Write a function =count_calls= that uses a static local variable
  =call_count= to keep track of how many times =count_calls= was called.

  #+begin_src C
    void count_calls(void)
    {
      static int call_count = 0;
      call_count++;
      printf("Function called %d times\n", call_count);
    }

    int main(void)
    {
      count_calls();
      count_calls();
      count_calls();
      return 0;
    }
  #+end_src

  #+RESULTS:
  : Function called 1 times
  : Function called 2 times
  : Function called 3 times

- Unlike a regular local variable, the value of =call_count= persists
  across multiple function calls.

- To test that, turn =call_count= into a regular variable in the code
  block above and run the program again.

* Type conversion

- For the computer to perform an arithmetic operation, the operands
  must be of the same size (same number of bits) and be stored in the
  same way (same data type).

- C allows the basic types to be mixed in expressions: you can combine
  =int= and =float=, and even =char= in a single expression. Can you explain
  the following =result=?
  #+begin_src C
    int i = 1;
    float x = 1.f;
    char c = 'a'; // ASCII value is 97
    double result = i + x + c;
    printf("%g\n", result);
  #+end_src

  #+RESULTS:
  : 99

- Explanation:
  #+begin_quote
  To compute =double result=, =i=, =x=, and =c= are implicitly converted to
  =double=. This is a /widening/ conversion for the numeric variables =i=
  and =x=, and a conversion from =char= to =int= and from =int= to =double= for
  =c=. For the conversion to =int=, the numeric ASCII value of =c= is used.
  #+end_quote

  #+begin_src C
    char c = 'a'; // ASCII value is 97
    printf("ASCII value of %c = %d\n",c,c);
  #+end_src

- C also allows /explicit conversion/ using the /cast/ operator, and
  explicit /type definitions/ with =typedef=.

* PROJECT Type conversion

- *Task*: Modify the following program to perform explicit type
  conversion when calculating the =result=:

  #+begin_src C
    int i = 1;
    float f = 1.5;
    char c = 'A';

    // implicit conversion
    double result = i + f + c;
    printf("Result (implicit conversion): %f\n", result);
  #+end_src


#+RESULTS:
: Result (implicit conversion): 67.500000

- Solution: Explicit conversion
  #+begin_src C
    int i = 1;
    float f = 1.5;
    char c = 'A';

    // implicit conversion
    double result = i + f + c;
    printf("Result (implicit conversion): %f\n", result);

    // explicit conversion
    result = (double)i + (double)f + (double)c;
    printf("Result (explicit conversion): %f\n", result);
  #+end_src

  #+RESULTS:
  : Result (implicit conversion): 67.500000
  : Result (explicit conversion): 67.500000

* Full Code for Stack Implementation

- *Task*: Turn the function definitions below into a working program.

- Solution: Code for the stack implementation:
  #+name: stack
  #+begin_src C :main no
    #include <stdbool.h> // adds data type `bool`
    #define STACK_SIZE 20

    /* external variables */
    int contents[STACK_SIZE];
    int top = 0;

    /* function prototypes */
    void make_empty(void); // set top to 0
    bool is_empty(void); // check if top is 0 (stack empty)
    bool is_full(void); // check if top is STACK_SIZE (stack full)
    void push(int i); // push i onto stack (if not full)
    int pop(void); // pop top stack element
    int stack_overflow(void); // stack overflow (push to full stack)
    int stack_underflow(void); // stack underflow (pop from empty stack)                         // returns 1
    int print_stack(); // print stack as array
    /* main program */
    int main(void)
    {
      // push number onto stack
      push(1);
      print_stack();
      push(1);
      print_stack();
      //print_stack();
      // pop number from stack
      pop();
      print_stack();
      // pop number from stack (trigger underflow)
      //pop();
      // push STACK_SIZE numbers onto stack
      for (int i=0; i < STACK_SIZE; i++)
        push(1);
      // push number onto stack (trigger overflow)
      print_stack();
      //push(100);
      //push(101);
      return 0;
    }
    /*****************************************************************/
    // make_empty: set stack top index to zero
    // no parameters (void), no return (void)
    // modifies external variable `top`
    /*****************************************************************/
    void make_empty(void)
    {
      top = 0;
    }
    /*****************************************************************/
    // is_empty: check if stack is empty and return Boolean
    // no parameters (void), returns `bool`
    // checks if external variable `top` is zero
    /*****************************************************************/
    bool is_empty(void)
    {
      return top == 0;
    }
    /*****************************************************************/
    // is_full: check if stack is full and return Boolean
    // no parameters (void), returns `bool`
    // checks if external variable `top` is STACK_SIZE (constant)
    /*****************************************************************/
    bool is_full(void)
    {
      return top == STACK_SIZE;
    }
    /*****************************************************************/
    // push: add integer to top of non-full stack
    // takes integer parameter (int), returns nothing (void)
    // uses external `top` as index for stack array `contents`
    // if stack is full, call stack_overflow
    /*****************************************************************/
    void push(int i)
    {
      if (is_full())
        stack_overflow();
      else
        contents[top++] = i;
      //return is_full() ? stack_overflow() : contents[top++]=i;
    }
    /*****************************************************************/
    // pop: extract integer from top of non-empty stack
    // no parameters (void), returns integer
    // uses external `top` as index for stack array `contents`
    // if stack is empty, call stack_underflow
    /*****************************************************************/
    int pop(void)
    {
      if (is_empty())
        stack_underflow();
      else
        return contents[--top];
    }
    /*****************************************************************/
    // stack_overflow: exits with 1 and aborts if stack is_full
    // no parameter (void), returns integer (EXIT_FAILURE)
    /*****************************************************************/
    int stack_overflow(void)
    {
      printf("Stack overflow!\n");
      return EXIT_FAILURE;
    }
    /*****************************************************************/
    // stack_underflow: exits with 1 and aborts if stack is_empty
    // no parameter (void), returns integer (EXIT_FAILURE)
    /*****************************************************************/
    int stack_underflow(void)
    {
      printf("Stack underflow!\n");
      return EXIT_FAILURE;
    }
    /*****************************************************************/
    // print_stack: print stack as array `contents`; constant
    // no parameter (void), returns integer from `contents` (external)
    /*****************************************************************/
    const int print_stack(void)
    {
      printf("top = %d\n",top);
      for (int i=0;i<STACK_SIZE;i++)
        printf("%d ", contents[i]);
      puts("");
    }
  #+end_src

  #+RESULTS: stack
  : top = 1
  : 1 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0
  : top = 2
  : 1 1 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0
  : top = 1
  : 1 1 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0
  : Stack overflow!
  : top = 20
  : 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1

* PROJECT External variable bug

The following example is supposed to display a 10 x 10 arrangement of
=+= signs:

#+begin_src C :main no
  int i;  // external counter variable

  void print_one_row(void)
  {
    for (i = 1; i <= 10; i++)
      printf(" +");
  }

  void print_all_rows(void)
  {
    for (i = 1; i <= 10; i++) {
      print_one_row();
      printf("\n");
    }
  }

  int main(void)
  {
    print_all_rows();
    return 0;
  }
#+end_src

#+RESULTS:
: + + + + + + + + + +

Can you explain this?
#+begin_quote
- When =print_one_row= returns after being called the first time in
  =print_all_rows=, we have =i=11=.
- The =for= loop in =print_all_rows= tests =i= and exits because 11 > 10.
- So, =print_one_row= is not called again.
#+end_quote

Fixed code without external counter variable:
#+begin_src C :main no
  void print_one_row(void)
  {
    int i;
    for (i = 1; i <= 10; i++)
      printf(" +");
  }

  void print_all_rows(void)
  {
    int i;
    for (i = 1; i <= 10; i++) {
      print_one_row();
      printf("\n");
    }
  }

  int main(void)
  {
    print_all_rows();
    return 0;
  }
#+end_src

#+RESULTS:
#+begin_example
+ + + + + + + + + +
+ + + + + + + + + +
+ + + + + + + + + +
+ + + + + + + + + +
+ + + + + + + + + +
+ + + + + + + + + +
+ + + + + + + + + +
+ + + + + + + + + +
+ + + + + + + + + +
+ + + + + + + + + +
#+end_example

* Guessing a number

- We'll write a simple game-playing program: the program generates a
  random number between 1 and 100, which the user attempts to guess in
  as few tries as possible.

  Sample output:
  #+begin_example
  A new number has been chosen.
  Enter guess: 55
  Too low; try again.
  Enter guess: 65
  Too high; try again.
  Enter guess: 60
  Too high; try again.
  Enter guess: 58
  You won in 4 guesses!

  Play again? (Y/N) Y

  A new number has been chosen.
  Enter guess: 78
  Too high; try again.
  Enter guess: 34
  You won in 2 guesses!
  #+end_example

- Which tasks will this program have to carry out? Each of them will
  be put in a function:
  #+begin_quote
  1) Initialize the random number generator
  2) Choosing a secret number randomly
  3) Read user guess, compute and print answers
  #+end_quote

- We write each of these functions first and then create the =main=
  program with the external variables, prototypes, function calls.

- =stdlib= has several functions to generate random numbers. We use
  =srand= from =stdlib.h=. The function requires a seed. It does not
  return any value, and it takes any number as seed value[fn:5].

- As seed, we use the =time= function from =time.h=, which returns the
  current time encoded in a single number, the number of seconds that
  have elapsed since /the Epoch/, the starting point for Unix system
  time, defined as 00:00:00 UTC on January 1, 1970.
  #+begin_src C
    #include <time.h>

    time_t current_time; // `time_t` is a portable data type for time data
    current_time = time(NULL); // return the current time but don't store it anywhere
    printf("The current time in seconds since the Epoch: %ld\n", current_time);
  #+end_src

  #+RESULTS:
  : The current time in seconds since the Epoch: 1729971344

- Now the function to initialize the number generator (requires to
  =include= =stdlib.h= and =time.h=). We give it a =#+name= to use it with
  =noweb= later[fn:6]:
  #+name: initialize_number_generator
  #+begin_src C :results none
    /***************************************************************/
    // initialize_number_generator: Initializes the random number
    //                              generator using the time of day.
    /***************************************************************/
    void initialize_number_generator(void)
    {
      srand ( (unsigned) time(NULL));
    }
  #+end_src

- To choose a secret number randomly, generate a random number with
  =stdlib::rand(void)=: this function chooses a pseudo-random integer in
  the range =[0,RAND_MAX]=, where =RAND_MAX= is defined in =stdlib=:
  #+begin_src C
    #include <stdlib.h>
    printf("%d\n",RAND_MAX); // (2^32)/2 - 1
  #+end_src

  #+RESULTS:
  : 2147483647

- Here is an example. The first loop generates random numbers, and the
  second loop scales them to =[1,100]=:
  #+begin_src C
    #include <stdlib.h>
    #include <time.h>
    #define MAX_NUMBER 100;
    int i, r1[10], r2[10];
    srand(time(NULL)); // this guarantees different sets of random numbers
    for (i=0;i<10;i++) {
      r1[i]=rand();
      r2[i]=r1[i] % MAX_NUMBER + 1;
      printf("%12d => %4d\n",r1[i],r2[i]);
     }
    printf("%d",RAND_MAX);
  #+end_src

  #+RESULTS:
  #+begin_example
    1169779990 =>   90
     930983597 =>   97
    1505412368 =>   68
     530674096 =>   96
    1501075191 =>   91
    1863310182 =>   82
    1971166917 =>   17
     718293902 =>    2
    1745128324 =>   24
     897181313 =>   13
  2147483647
  #+end_example

- A function to choose a secret number and store it in an /external/
  variable =secret_number=:
  #+name: choose_new_secret_number
  #+begin_src C :results none
    /*****************************************************************/
    // choose_secret_number: Randomly selects number between 1 and
    //                       MAX_NUMBER and stores it in secret_number
    /*****************************************************************/
    #define MAX_NUMBER 100;
    void choose_new_secret_number(void)
    {
      int secret_number = rand() % MAX_NUMBER + 1;
    }
  #+end_src

- Our last function is a function to read the guesses and compare them
  to the secret number.
  #+name: read_guesses
  #+begin_src C :results none
    /*******************************************************************/
    // read_guesses: Repeatedly reads user guesses and tells the user
    //               whether each guess is too low, too high, or correct.
    //               When guess is correct, prints total number of guesses
    //               and returns.
    /*******************************************************************/
    void read_guesses(void)
    {
      int guess, num_guesses = 0, secret_number;

      for (;;) { // infinite loop left if guess correct
        num_guesses++;
        printf("Enter guess: ");
        scanf("%d",&guess);
        if (guess == secret_number) {
          printf("You won in %d guesses!\n\n",num_guesses);
          return; // only allowed in void function if no argument given
        } else if (guess < secret_number)
          printf("Too low; try again.\n");
        else
          printf("Too high; try again.\n");
      }
    }
  #+end_src

- Let's put this together:
  #+name: guess.c
  #+begin_src C :main no :includes :tangle guess.c
    #include <stdio.h>
    #include <stdlib.h>
    #include <time.h>

    #define MAX_NUMBER 100 // secret number between 1 and MAX_NUMBER

    int secret_number; // external variable

    void initialize_number_generator(void);
    void choose_new_secret_number(void);
    void read_guesses(void);

    int main(void)
    {
      char command; // flag for quitting the game
      printf("Guess the secret number between 1 and %d.\n\n", MAX_NUMBER);
      initialize_number_generator();
      do {
        choose_new_secret_number();
        printf("A new number has been chosen.\n");
        read_guesses();
        printf("Play again? (Y/N) ");
        scanf(" %c", &command);
        printf("\n");
      } while (command == 'y' || command == 'Y');

      return 0;
    }

    <<initialize_number_generator>>
    <<choose_new_secret_number>>
    <<read_guesses>>
  #+end_src

  #+RESULTS: guess.c
  : Guess the secret number between 1 and 100.
  :
  : A new number has been chosen.
  : Enter guess: You won in 1 guesses!
  :
  : Play again? (Y/N)

- Practice: alter =choose_new_secret_number= and =read_guesses= so that
  =secret_number= does not have to be an external variable.

- Challenge: Can you figure out how to make the numbers repeatable so that you
  can repeat a game?

- Compare this with the "Guess the number" program in Python ([[https://github.com/birkenkrahe/cor/blob/main/org/4_guessing_game.org][GitHub]]):

  #+begin_example python
    import random
    num = random.randint(1,20)
    attempt = 0
    print("Guess my number! Enter a number between 1 and 20!")
    while True:
        guess = int(input('Take a guess: '))
        attempt = attempt + 1
        if guess < num: print("Too low")
        elif guess > num: print("Too high")
        else:
            print("Attempts: " + str(attempt))
            break
        if input("Enter 'q' to quit (or RET to continue: ")=='q': break
  #+end_example

